app/views/recipes/show.html.erb

SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."recipe_id" = ?  [["recipe_id", 26]]
---
  	  	<ul>
  	  	  <% @recipe.ingredients.each do |ingredient| %>

SELECT "directions".* FROM "directions" WHERE "directions"."recipe_id" = ?  [["recipe_id", 26]]
---
  	  	<ul>
  	  	  <% @recipe.directions.each do |direction| %>