app/controllers/recipes_controller.rb

	def index
	  @recipes = Recipe.order('created_at DESC')
---
SELECT "recipes".* FROM "recipes"  ORDER BY created_at DESC

	def create
	  @recipe = current_user.recipes.build(recipe_params)

	  if @recipe.save
---
INSERT INTO "recipes" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "First Recipe"], ["description", "testing description\r\n"], ["created_at", "2015-10-28 13:03:17.892455"], ["updated_at", "2015-10-28 13:03:17.892455"]]

	def update
	  if @recipe.update(recipe_params)
---
UPDATE "recipes" SET "image_file_name" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "recipes"."id" = ?  [["image_file_name", "food4.jpeg"], ["image_file_size", 13484], ["image_updated_at", "2015-10-28 14:18:00.839032"], ["updated_at", "2015-10-28 14:18:00.879094"], ["id", 5]]